{"id": 0, "context": ["Are you looking for an apartment?", "Yes, I am interested in finding a one-bedroom apartment near Washington Square.", "I think I have just a right apartment for you."], "positive_responses": ["Well! That is really good news.", "Are you serious! Where is it?", "Could you please tell me something more about it?", "That is awesome! Could you please show it to me?", "Really! What is the rent they are asking for? Do you know it?"], "adversarial_negative_responses": ["I think, most of the people wanted to travel to holy place to get a right path in their life.", "Anger rusts intellect so I think that it cannot discern right from wrong", "There is a huge temple recognized near to the building which is familiar with those localities.", "In my the bed room the things which is spread over is so rediculous. I couldnt acquiste.", "Yes, I am fond of having an ice cream with strawberry flavour in my new apartment."], "random_negative_responses": ["I don't know. My parents are coming to pick me up.", "It is not far from your home. So, come on foot.", "I hope everything will be alright. I had a important work to do.", "I think it should be a ring then.", "I don't want to be sick. So, don't talk about it."], "random_sampled": ["What's up? You look unhappy.", "Certainly. The package includes air travel to and from paris, accommodations, meals and transportation around the city.", "Let me see, oh it's a sunny day. You will have a nice trip tomorrow.", "Say hello to your friends for me.", "Yes.", "What's the matter, are the classes you want full?", "Hi, i'm back! Hmm... Your hair is pretty damaged, and you've got split ends.", "The question is, can he have it done before friday?", "Good. Let's go now.", "Certainly, may i take your name? I'll let her know you've arrived.", "This is mr. Gao. How are you?", "Problems are inevitable.", "If you hire me, i'll start studying spanish again.", "I might just do that. What style of clothes do they have?", "I like all kinds as long as they are exciting.", "I love it when the weather is like this. Why don't we sit down outside and have our lunch?", "So it's the subjective criteria like team building and colleague support that you find hard?", "We shall be pleased to talk the matter over with you. You've done very well in fulfilling the agreement.", "I haven't even told you what it is yet!", "Customs."], "bm25_sampled": ["Yes, i am interested in finding a one-bedroom apartment near washington square.", "I prefer a one-bedroom apartment.", "Hi. I'm interested in renting a one-bedroom apartment.", "It's a one-bedroom, one-bathroom apartment.", "A one-bedroom apartment has one bedroom, a living room, a kitchen and a bathroom.", "Actually, the one-bedroom is the only vacant apartment right now.", "Good day. I'm looking for a one-bedroom apartment today.", "Ah! I get your point. We have just what you need. Our jinyuan apartments have several floor plans. The one bedroom apartments are very economical, but their layout makes great use of a small amount of space. I think you can find the right apartment there.", "Hi. I'm tom peterson. I'm looking for a one-bedroom apartment.", "Yes. I won't have to take a bus to go to my office. Is it a one-bedroom apartment?", "I'll share it with one of my friends. What's in a one-bedroom apartment?", "Ah! I get your point. We have just what you need. Our jinyuan apartments have several floor plans. The one bedroom apartments are very economical, but their layout makes great use of a small amount of space. I think you can find a very apartment there.", "Yes. I'm looking for an apartment. I'd like two bedrooms.", "Yes. I'm looking for an apartment, i'd like two bedrooms.", "I want a two-bedroom apartment.", "The two-bedroom apartment on 38th east street.", "Well, we'll supply you with an apartment of a bedroom and a living room.", "No. It probably means they have a large apartment. Probably a living room, kitchen and three bedrooms. They need someone for the empty bedroom.", "A new two-bedroom apartment, around 100 to 120 square meters, in the sanlitun area.", "Jeez... I didn't realize a single bedroom apartment went for so much these days."]}
{"id": 1, "context": ["I'm looking for the produce section, please.", "All of the produce is in aisle A.", "Are bananas on sale today?"], "positive_responses": ["No, it's not kept on sale today.", "Yes, they are on sale with a discount of 10 percent.", "As it is not a season of bananas, it will cost more for you.", "Yes, they are on sale, but they are not ripe.", "Bananas will be on sale tomorrow."], "adversarial_negative_responses": ["That champagne that was produced in France is on sale today.", "The sweet banana chips are produced in Kerala.", "I am eating a banana that I brought yesterday.", "As I walked down the aisle I found a section of puzzles.", "I am looking for pineapples that are on sale today."], "random_negative_responses": ["Alright, after hearing these information I really need to think twice about it.", "Last two days, I am facing these health issues. I don't know whether it is virus fever or not?", "Sam and Samantha are getting married.", "I want to participate in it. Could you help me on it?", "If so, please issue me a temporary card."], "random_sampled": ["Alright... And did you have some specific questions about your application?", "What isn't working on it?", "Well, if i were you, i'd go to see the doctor. That might help. And you'd better stay in bed today instead of going to work.", "Well then maybe you should resolve to sticking to your goals and objectives.", "The internet's a lot worse.", "I got the message. I'm quiting.", "Is it the same in america?", "I'm really glad to hear that", "Maybe we can try'yuanyang pot'this time. You can choose the non-spicy soup base.", "The police don't know who did it.", "That sounds fine. If you could give me the name and address of the dealer i'll go over there now and see what they've got.", "Thank you. I have an 8 o'clock appointment tomorrow morning, i would like a wake-up call.", "No, thanks. I'm full.", "I can't vote on tuesday.", "Oh, everything comes back to life in spring and the weather gets warmer.", "Uh-huh.", "So what?", "I think i am who you are looking for. You have got to be rubin.", "Here's your bill.", "I don't need to drink every weekend. I could be happy just staying home, you know."], "bm25_sampled": ["Aisle a is where you'll find all the produce.", "All of the produce is in aisle a.", "Is there any produce on sale?", "Do you know what produce is on sale?", "I'm sure something is on sale. Please check with the produce person.", "They are all produced in china, aren't they?", "Are bananas on sale today?", "Good. A wrapping that catches the eye will certainly help push the sales. With competition from similar garments producers, the merchandise must not only be good value but also look attractive.", "All right. We'll get in touch with our producers and see what they have to say.", "I think, first of all, i would ask the consignee to produce survey report on loading, if they can't produce that i would suggest them to refer the case to their shipper. Meanwhile, bad weather could be agood excuse to refuse the responsibility.", "What country produces them?", "There is some, but my country is not amongst the leading producers. The oil and coal deposits are in the north of my country. Your country is a big oil producer, isn't it?", "Stop producing cigarettes.", "Yes, it will ; this must be the foreign produce.", "Here you go. Look in this flyer, or check with the produce person.", "We produce household cleaning products - detergents and so on. They are all phosphate-free, which minimises damage to the environment.", "I don't know, but i'm sure the produce person can tell you.", "Mmmm, sounds interesting... Gourmet chocolates, where are they produced? Belgium?", "But doesn't incineration produce carbon monoxide?", "I don't know. Check the flyer or check with the produce person."]}
{"id": 2, "context": ["Good afternoon, Mrs . Brown . I've come to see Mr . Brown.", "Good afternoon, Mr . Green.", "Is he in?", "I'm sorry, but he's not in, he's gone out on business.", "Oh! I just drop in on him for a chat.", "Please come in for a cup of coffee."], "positive_responses": ["At what time can I expect him to come?", "Sure, why not!", "Do you have any idea how long it will take?", "Yes sure, thank you Mrs Brown!", "Does he go out very often?"], "adversarial_negative_responses": ["Please meet me in my office this afternoon.", "Sorry to bother you but you need to come to the business conference.", "I would love to stop and chat but I have to drop my niece home.", "I dropped the cup of coffee.", "My father always has a biscuit and a cup of tea in afternoon."], "random_negative_responses": ["Really? I heard that he was a coward.", "I wish I could, but I am really busy at the moment.", "My house would be a double bedroom one.", "Do you want any help from me?", "I thought it would be easy though."], "random_sampled": ["One. And, if possible, i'm looking for a non-smoking room.", "I have my own company that designs computer systems.", "30% of the people are attracted by the style. Buyers always pay great attention to packing. In my opinion, these goods didn't sell well merely because of the poor packing.", "It's very hot, the temperature is often over 40c.", "Name it.", "And this kitchen is so clean. Did you help johnny with that?", "This one.", "Yes, i'm going to the cinema, dad.", "What can i do for you, kim?", "Just in case you have to leave, we will just use the master key.", "Thanks, that's very kind of you to say. I hope my necklace goes with my dress, and they both make me look good i feel.", "Not really. I like looking on the internet at what's available, but i usually prefer to actually see and touch what i'm buying before i pay for it. Sometimes, i'll look at something in a shop, but lat", "I've worked here for two years. And i want to do something different.", "I like that.", "Calm down, sir. You are creating a commotion.", "Lt's made of silk and you had better wash it by hand in cold water.", "No, i'm not sure. I think about 65 mph, right?", "How much duty should i pay?", "How long will the trip take?", "Sir, your dish will take 5 minutes to prepare. While waiting, would you like anything to drink?"], "bm25_sampled": ["Good afternoon, could you connect this call with mr brown, please", "Good afternoon, mr. Brown. My name is mrs. Anderson, manager of the sales department.", "Good afternoon, mr. Green.", "I'm mr. Stephen's secretary. He has an appointment with mr. Green today.", "I'm afraid mr wilson would like to speak to mr brown right now. He's got an urgent matter to discuss with mr brown without delay.", "Tomorrow afternoon, um... You see, i've made an appointment with mr. Comet for tomorrow afternoon. In order to meet mr. Zhang, i have to cancel the appointment with mr. Comet, i'm afraid.", "This is wang miao from ab company speaking. Our ceo mr. Green has an appointment with mr. Liang tomorrow morning. But there is a minor change in tomorrow's schedule. Mr. Green has an abrupt urgent case tomorrow and he has to go abroad today. He wanted me to convey his apology to mr. Wang.", "Good afternoon, mrs smith.", "And mr. Green will make another appointment when mr. Wang comes back.", "Good afternoon. Have a seat, please. You are mr. Sun?", "This is mr brown speaking. I'd like to speak to mr. Thomas, please.", "( after a while ) good afternoon, mrs. Smith. I called you just now.", "Good afternoon, i'm looking for mr. Alert li.", "We have an appointment for this afternoon. Mr. Chen will know why i'm calling.", "I'm afraid that he can't, mr croft. Can't you wait till this afternoon?", "Mr. Smith is not in his office. I am afraid he will not be back before 3 pm. Would you care to speak to mr. Brown who takes all the calls in his absence?", "Hold on a second, please. I'll see if he's in. I'm sorry, mr. Baker had just gone out. Who's calling?", "Ok, then would you please hold the line? Mr li, the line is through, mr brown is ready answering the call, go ahead.", "I'm sorry, mrs li, mr brown is now in a meeting. May i have your number, and ask him to call you back later?", "Good afternoon, mr. Black. Thank you very much."]}
{"id": 3, "context": ["Have you got any hobbies?", "Yes . I'm fond of playing the chess and I'm very keen on playing cards.", "Which is easier to learn?"], "positive_responses": ["Both are easy to learn.", "Chess is easy to learn.", "Don't you know how to play chess?", "Do you want me to teach you how to play cards.", "Cards is fun and easy to play. Do you want to play with me?"], "adversarial_negative_responses": ["I see from the postmark that this card was mailed from Mary's holiday address.", "I thought I heard something - my ears must have been playing tricks on me.", "I have very fond memories of my time in Spain.", "Yes, Encourage your child in her interests and hobbies even if they're things that you know little about.", "It comes as no surprise to learn that they broke their promises."], "random_negative_responses": ["You check in your room and I will check mine.", "By the way, we have to prepare for the picnic party. You can join us.", "How to search for the polling place?", "Oh, see there it already started raining.", "To be honest! Everyone was jealous about then, why shouldn't they?"], "random_sampled": ["Good luck.", "Tom, that lucky guy.", "I don't know... Well, i guess i'll take them, since you don't seem to have anything better.", "I have no idea. What about you?", "Thank you.", "Not bad. Ok, now take some meat and potatoes from the fridge.", "The company regulates that men should wear a suit and tie in business meeting. Company policy is not negotiable.", "Sir, when i deleted the $10, the program automatically added a $2 service charge.", "What happened?", "Yes, one last thing", "Well, the cigarettes and the champagne are not in excess of the duty-free allowance. But according to our law, each passenger is allowed only one camera duty-free. You'll have to pay duty for the other one.", "That sounds like a good idea.", "We are going to use this cuff here, and it will give me a reading.", "I am a journalist. I write for china daily.", "Within a month after your letter of credit reaches us.", "Yes. I've been to new york. I got back only yesterday.", "50 dollars. That's too much.", "I want to go to the financial stree.", "And then?", "Yes. The palace hotel. You have to be there."], "bm25_sampled": ["Yes. I'm fond of playing the chess and i'm very keen on playing cards.", "Do you have any hobbies besides playing chess?", "We haven't played chess for a long time. How about playing chess?", "I like playing chess.", "I usually play chess with my friends. But i like playing basketball best.", "I'm afraid playing the chess like that will soon make me an old man. I noticed that most chess players were bald.", "But you promised to play chess with me this afternoon.", "Yes. Playing chess is a very aggressive experience. All the pieces are supposed to capture their opponents. Whenever i start a chess game, i can't help but imagine a concrete battle in which all fighters stand ready to kill.", "It must be fun. But you know, i am not good at chess. I never won since i've learnt to play chess.", "A chess board! Daddy is going to teach you how to play!", "Yes, i think so. My friend once used it mostly to play chess, but now he has learnt how to do other things on the internet.", "Do you have any hobbies like playing tennis or things like that?", "There's another distinctive contrast. Both board games use a total of 32 pieces, but xiangqi is played on a 9 - by - 9 board, bigger than the 8 - by - 8 board used in chess.", "I like playing games and having sports. They are my favourite hobbies.", "Yes, i played shooting guard, i like shooting and you'll play inside, ok?", "I can play drums, but i haven't played for a while. I'm not sure i'd be good enough to play in a band.", "You can learn chinese checkers or military chess. Both of them are much easier.", "No, i'm not very good at it. I play just for the fun of it.", "Yes, i like ping-pong very much, but i can't play well.", "I see, but games are played in different ways. I'm wondering what type of games do you like to play?"]}
{"id": 4, "context": ["Yes . This one must fit you.", "It's a bit loose . Do you have a middle size?", "I'm afraid not, sir."], "positive_responses": ["Can you please check once? I really liked it.", "That's a pity.", "Is there any possible that I can buy it?", "Then let me choose something else.", "I have to do alteration for this one."], "adversarial_negative_responses": ["I am afraid that these things will not fit in one box.", "I think this cake must be a little bit softer.", "Please give me 100gm of loose tea powder.", "That detached house is not connected to my building.", "I hope I can find the one who is afraid of losing me."], "random_negative_responses": ["It's okay, we will have that dry chicken and fish.", "Your fridge is already filled up with chocolate and sweets. How much more you want?", "What is the name of your dog?", "Yes why not! I will book you appointment of 12:45, have a good day Sir.", "Okay, I will prescribe you some medicine for your pain."], "random_sampled": ["All i want is the same thing on this card.", "I like doing aerobics in my spare time. It's good for my health.", "I didn't think about it that way.", "Overwork-amongst other things. You can't work 24 hours a day. You've got to slow down.", "Which would you rather have, beef or chicken?", "Of course. I have one i can suggest.", "Thank you.", "But i can't miss the flight. It's an important meeting and it's waiting for me.", "I do all the cooking.", "What's the charge?", "Yes, a continental one contains eggs, bacon, toast and juice. American one is the same as a continental one except the egg.", "Ok. I like the design of this lamps. I also need some cushion covers. I'll just browse through those ones over there.", "It tastes funny. Why can't people just stick to plain and simple coffee?", "I'm sorry i'm late. I overslept. Is the manager here today?", "Oh, i seem to lose something every time i travel.", "Who's that guy who's handing out beer to everyone?", "My aunts studied in the american universities. They say that extensive reading for fun is the most effective way to improve your english. That's what they learn here in america.", "Mary said jack was cheating on her. Jack was seeing a girl from his hometown. One day, mary saw them holding hands and ended the relationship immediately.", "You know i'm interested in teaching. I'm looking for jazz students...", "Well, let me talk to my manager, okay?"], "bm25_sampled": ["It's a bit loose. Do you have a middle size?", "I'm afraid i haven't got one in your size.", "Yes. This one must fit you.", "It's just the right size-a perfect fit! Have you seen anything you like?", "It doesn't fit quite right. It feels a little tight in the waist. Do you have this in a larger size?", "Middle size", "Will the object fit into this size of box?", "No, it is a middle-sized private company.", "I'm sorry. We don't have this color in your size. We have some green ones in your size. Would you please have a look at this green one?", "Yes, the fitting room is over there, it looks fantastic on you, this style color in sizes natural here and figure, perfectly.", "It's just the right size--a perfect fit! I'll take it. Oh, no, i'm a little short. Did you bring your credit card?", "That's right. Now try on this one. It's size 41.", "I am afraid this is the biggest size we have.", "Yes. This big one is badly decayed. I'm afraid it must be taken out.", "Hmm... It's hard to figure out the exact size, i'm afraid.", "Yes. ( after trying ) a bit tight actually, they pinch my toes. Have you got a larger pair. Size 39?", "Yes, we have several rooms available. Would you like two twin beds or one queen size bed?", "I wonder if you can change it to one size down.", "We have only one mid-size car left.", "This one is the same size and color. But the design is different."]}
{"id": 5, "context": ["Good afternoon! Trans Pacific Airline . How can I help you?", "I ’ m calling to cancel my reservation for Trans Pacific Flight 8 on July 19 from Taipei to Minneapolis . Could you please make it for the same flight on August 2 instead of July 19?", "What ’ s your name, please?"], "positive_responses": ["Rudy Randolph and my number is 818-555-1234.", "The reservation was made under my brother's name. His name is Steven.", "Stanson and what other information you need from me?", "Yes, My name is Armaan. Can you please change my reservation date?", "Yes I am Stephany Rose. Would you want me to spell it?"], "adversarial_negative_responses": ["A good friend will make you feel comfortable being who you are.", "Yesterday my friend cancelled her flight ticket online.", "If you call the hotline, you will talk to an automated system instead of a real person.", "I will just cancel my afternoon board meeting.", "My friend called the travel agency and made reservation of two flight tickets."], "random_negative_responses": ["It certainly is not a simple thing.", "Have you ever been to that store? Do you know about the availability of books over there?", "Oh ok, make sure you consult the doctor.", "What is the cost of this one?", "I am happy that I have helped you."], "random_sampled": ["Fill in the slip, stating the exact amount you wish to withdraw, please.", "I'm mike kowalski and my card number is 5211678 44, but there are some other numbers at the beginning. I'm not sure what they are.", "I left after the opening dance. I couldn't wait to get out of there.", "Is that all doctor?", "What's your problem! Geez. Having a fit is not going to help!", "I have no choice. My mother is always very strict with me.", "It's us 100 for rib 802 today.", "May i have a magazine or a newspaper please?", "He's my grandfather, and he never really liked you anyway!", "It's friday. We should go party.", "I bet. You must be stoked.", "No problem. Wish you a nice trip.", "Well, my train is due to take off at 7:25 a. M. I've no idea how long it'll take to drive to the railway station.", "I want to say goodbye. I'm leaving for america tomorrow.", "We charge a small fee every time you overdraft.", "I can't. I have to meet someone.", "I mean, i understand that. But the speed of the conversation got faster and faster, until it seemed to me that they would fight. My perception of the tone was that it was a violent shouting match. The truth was that it was a perfectly normal conversation.", "Do you see anything that you like?", "The toilet flushes really slowly.", "No, that's too early. I'll still be at work then."], "bm25_sampled": ["Sorry, there is no flight available on july 21st.", "I can give you a reservation on flight no cz 387 on july 22nd.", "I'd like to confirm a reservation, please. My name is wang lin. My flight is kf98.", "Yes, unlikely my flight will be 2 hours due to the fog. Would you please keep my reservation?", "But now i want to make a change. Please cancel this flight and transfer me to flight gb105.", "Just a moment, please. I'm sorry but the flights are fully booked on that day. The next available flight is on may 2nd. They have two flights, one is at 9:30 a. M. And another at 2:00 p. M. Both flights have seats available.", "Hello! I'd like to reconfirm my flight reservation.", "Just a moment, please. Let me check for you. ( a moment later ) thank you for waiting. I am sorry but our flights are fully booked on that day. The next available flight leaves at 4:00 pm on 20th. Shall i reserve you a seat on it?", "Hello. I'd like to reconfirm my flight, please.", "My name is zu ping. In fact, i have a reservation on flight no.125 for zhenjiang, leaving beijing at 2:00 p. M. Tomorrow. Now i'd like to make a change of my travel schedule. Is it possible to change my booking to the day after tomorrow?", "All right, sir. Please reconfirm your ticket no later than 12 noon two days before the flight ; otherwise, your reservation will automatically be canceled.", "All right, sir. Please reconfirm your ticket no later than 12 o'clock two days before the flight ; otherwise, your reservation will automatically be cancelled.", "May i have your name and flight number, please?", "Yes, could i make a reservation to new york on july 21st, next friday?", "Driver, can you please speed up? I m afraid i might miss the flight.", "I'd like a ticket for that flight please.", "May i know your flight number, please?", "May i have your flight number, please?", "Now i am afraid i can't get to the airport on that day. I want to change my flight for the 21st. Is that all right?", "How much luggage can i take for my flight?"]}
{"id": 6, "context": ["What time is the class?", "From 7 to 9 o'clock.", "How much does it cost?"], "positive_responses": ["It’s going to cost around 300$...", "Well! We charge 150$ a subject.", "For month, you need to pay $200.", "If you are attending in the group, then we will be giving discount.", "Don't worry it will not cost much, it is very cheap, just 500$ a month."], "adversarial_negative_responses": ["The museum has a clock on display, which is very costly.", "I am going to punish the entire class for not arriving on time for the morning prayer.", "The first time I cooked was in my 9th grade.", "It took a lot of time for me to travel from my house to the class.", "I gave a speech on time management in front of the entire class."], "random_negative_responses": ["And where it is? In highway?", "What if he refuses to talk to me?", "On what day his birthday falls.", "No. Only medium-sized companies are here.", "The studio is close to a beach."], "random_sampled": ["I like to hang out with my friends, play games and go swimming.", "How time flies! Now you are a college student out of a little girl.", "Absolutely! It says there is water on mars buried beneath the surface. It's just a matter of how deep it is.", "Saturday my parents are coming to town. What's up?", "Yes, that's the price they were advertising it at. I was hoping it might go on sale soon. Why, how much did you pay for it?", "Well, that's great.", "Here is the survey report from a well-known public surveyor in london. You may inspect the defective instruments personally", "You put it in the slot at the turnstile and then push the turnstile to get into the platform.", "That's a good idea. Let's discuss after work.", "When you woke up, the water was coming out the tub?", "Yes, you do. And you need to put out liquid items and your laptop in the box for inspection.", "How about this scarf, these earrings, and an anklet?", "Thank goodness we're not rich and famous!", "O. K.", "You tell me.", "Great! Work is really busy now, but it's fun.", "What's the problem?", "That's ok. Here is the address.", "Good morning, doctor. I feel terrible. I've got a cold and i have a rash here on my neck. I'm not sleeping well either. What do you think the problem could be?", "That's a secret. I couldn't tell you."], "bm25_sampled": ["Does the furniture from ikea cost a lot?", "What a find! So, how much does it cost?", "How much does it cost?", "How much does that cost?", "How much does it cost over there?", "How much does this house cost?", "How much does a mango cost?", "How much does the pair cost?", "Ok. How much does it cost?", "From 7 to 9 o'clock.", "Well, i had english from 9 o'clock to 11 o'clock, art from 12 o'clock to 2 o'clock, and math from 2 o'clock to 4 o'clock.", "Very good. How much does that cost?", "How much does a student pass cost?", "Oh, excellent. How much does it cost?", "2 nights, how much does it cost?", "How much does the green one cost?", "Day tour. How much does that cost?", "One is ok. How much does it cost?", "How much does it cost per day?", "Oh, i like it very much. How much does it cost?"]}
{"id": 7, "context": ["I hope to major in English literature, but the admissions counselor told me that many people change their major many times in their first year, so we ’ ll see.", "What are the fundamental course?", "In order to graduate, every student must take a certain amount of classes in history, math, English, philosophy, science and art."], "positive_responses": ["That is a mixture of all the subjects.", "As I suggested major in History.", "Yes great. You can decide later on which subject you want to major in.", "Okay and by the way he is right. Even I changed my subject in the first year.", "I really cannot handle so many subjects."], "adversarial_negative_responses": ["I had gone to visit an apartment that I plan to buy but they told me that they don’t have the literature. They are hopeful to get it in a week.", "Just being a graduate will not fetch a job, you need to have some other major course to back it up.", "There is a certain amount of philosophy involved in the nature of human thought.", "Every student should ensure that they take part in the art and cultural program.", "Admissions to the schools are open and in order to get a seat there is an entrance test."], "random_negative_responses": ["I agree, now it is not that popular.", "What is the normal vision of human eye?", "Can you please tell me the exact time for the interval?", "You see it is a peak season and getting seats which we look for is slightly difficult. So, maybe next time I should go for online.", "Miss you too, have a safe journey."], "random_sampled": ["You too.", "All right.", "Well, i don't have any other questions so far. I would like to think for a couple of days before i give you my final answer.", "For me, this would be having good relationships with my family members. My family has always been very close knit, and we still spend a lot of time together.", "Yes, it's right over here.", "Great. At first, you can put the chairs back.", "Well, i like reading, walking, swimming, hiking and playing basketball", "Make it two.", "I would like the student pass.", "Well, would you please send someone to 502? I have some clothes to wash.", "I am going to post all of that information on the geology club web page. Check it out when you get a chance. See you monday!", "No, there is an updated virgin, three minutes video date. I know an online dating website providing such service with a microphone and webcam, you can sigh for it. You can be face-to-face with a guy talking for maximum three minutes.", "Well, it's a fruit with a big nut in it.", "How about the one next to the black gloves? It's very similar to the one you like.", "Shall we bring any thing? Some wine?", "Could you fill out this form, please, ma'am?", "If you think it is necessary.", "Could you tell me something about the terms and interest rates for personal automobile consumer loan?", "I don't want to beat around the bush so i'm just gonna come out with it. We are going to have to let you go.", "I'm still shocked that obama was elected."], "bm25_sampled": ["I'm studying english, math, and history. My major is english.", "I hope to major in english literature, but the admissions counselor told me that many people change their major many times in their first year, so we'll see.", "In order to graduate, every student must take a certain amount of classes in history, math, english, philosophy, science and art.", "I recently graduated from college as an english major.", "I graduated from the beijing foreign studies university. My major is english translation and interpretation.", "Yes, i will graduate from the people's university of china this july majoring in international trade. Besides, at school, i am a top student. Moreover, both my spoken and written english are pretty good.", "My major is english. Of course i'll apply for an english teacher.", "I'm majoring in english.", "Yes, that's right. After graduating from high school in new york i attended york university in the uk. My major was english, and my minor was business studies. I completed my ba in 2004.", "I want to work in the english department, as i am an english major.", "I majored in english and minored in chinese.", "I have been studying english since junior high school. And i majored in english in college.", "I graduated from beijing college of foreign trade. My major was international trade.", "Can you tell me why you changed your major when you were a graduate student?", "Tell me, lisa, what made you decide to be an english major?", "I graduated from beijing university. I majored in business administration.", "My major courses were microeconomics, macroeconomics, international trade, international finance, world economy, psychology and business english", "Yes. I am sure i can. I was an english major in college.", "If i had chance again, i'd major in english. You're good at language.", "What about your second foreign language since you were an english major?"]}
{"id": 8, "context": ["In the beginning of the interview, greet the interviewer with a kind smile.", "In the interview, use polite words, such as' Thank you', or' Please'.", "That's right . Details can mean succeed or fail."], "positive_responses": ["I didn't get you?", "Exactly. I totally agree with you.", "You seem to be very professional.", "I think you have given too many interviews and you know how we should win their confidence.", "Have you taken any interview and found any rude interviewee?"], "adversarial_negative_responses": ["Thank you for the Donut's, It has such a good taste. Can you prepare it for me whenever I visit your home?", "The best impression that can be created is at the beginning of the interview. So we must prepare ourselves how to greet and introduce ourselves.", "Sir, Can you please tell me some important points to remember while attending an interview? I have a face to face interview tomorrow and I need everything goes the right way.", "Do you know that polite words must be used not only in the interview but whenever you meet any people. This can create a good impression.", "Every detail on the resume is very important especially the details in the beginning of the pages during the interview process."], "random_negative_responses": ["I was looking for an expensive watch.", "I need to take rest after going to room.", "Ok, I will pay it by cash.", "Orange juice is what makes this breakfast healthy. Still need coffee?", "It's ok, When will you send?"], "random_sampled": ["I met with the supervisor just this morning. I don't know, but i am a little worried. Who do you think will get sacked?", "You'd better get up, or you'll be late.", "Ah... Hence the buns and condiments we bought. And this is holly's potato salad.", "Anything important happened?", "Yes, whenever i think about china, i'd see the tian'an men square. China is a very beautiful country. And i've seen many landmarks in china but i like the great wall most.", "Listen. This is an emergency. I tried to call my doctor, but he is out of town. So i can't see him in time. I need this medicine. It is for skin condition. I've run out. Can you just refill it once more?", "Mam, another minute, could i?", "I don't have one.", "I have two kids. A boy and a girl.", "Well, like since i'm black, i must like rap music, come from the inner city, or play basketball well.", "What's her personality like?", "Yes, i think so too.", "That's fine. Thanks. Enjoy your trip.", "I think so, too.", "Are you for real?", "Yes, i'll be promoted to department manager.", "How many potatoes do you need?", "I got my father's goat last night.", "Make sure that you don't go anywhere until you clean your room.", "Please wait a moment, i will bring you one."], "bm25_sampled": ["In the beginning of the interview, greet the interviewer with a kind smile.", "In the interview, use polite words, such as'thank you', or'please'.", "In the beginning of the interview, it is best that you make acknowledgments for the opportunity of the interview.", "The best would be you have a smile on your face in the interview to win a good impression of the interviewer.", "Today's interview is for us to get to know a little about you. If needed, there will be a more lengthy interview later. So, if you're comfortable, let's begin.", "At this moment you can thank the interviewer again for the opportunity of the interview.", "Appropriate greetings will win the interviewer's favorable impression", "If you succeed in doing that, you must attend the interview on time.", "Yes, when you attend the interview, you should pay attention to your manner, style of conversation and expression. You should keep smiling always, being polite when you talk with the interviewer. Don't move from time to time when you sit there. And you also should know how to use eye contact.", "Finally, at the end of the interview, make acknowledgments to the interviewer again.", "Smile at the interviewers and look them in their eyes while trying to persuade them to select you. Try to act natural, let your personality, ability and interpersonal skills shine through the interview", "We are all learning things that will help us in our interview. What do you think are some important considerations going into your interview?", "In a word, you should keep decent manners in the interview.", "If you go to the company without appointment, the interviewers may happen to be busy with other things, and have no time to give you an interview.", "We are all going to have great interviews. What are some things that we need to remember in an interview?", "Today's interview is for us to get to know a little about you. And the interview will last a little bit longer. So, if you're comfortable, i want to ask you some questions.", "Yeah, wear formal clothes to your interview and do be punctual. That'll leave your interviewers with a good first impression.", "The engineering manager and his team will interview the candidates. Hr will also be involved with the interview, but basically arranging the schedule and explaining the benefits.", "Thank you for your interview.", "Can you come in for an interview tomorrow at 10?"]}
{"id": 9, "context": ["Oh, I love you too!", "Come on . Put the gun down."], "positive_responses": ["Do you think that I am bad?", "Yes. I will put it down now.", "Are you going to marry me?", "I am so excited and happy that you love me.", "What you mean?"], "adversarial_negative_responses": ["Uttar Pradesh is the biggest producer of the country guns, you can literally purchase a gun with minimum cash.", "No matter how much big criminal you are mother's love always melts you down.", "Victory won't come to me unless I go to it.", "Love your neighbour, yet pull not down your hedge.", "Put down your gun and hand on your back."], "random_negative_responses": ["We have to attend their wedding.", "I don't know. I have never travelled before.", "Yes, both animals won't leave their babies from their arms.", "I suggest you don't sell your shares now.", "Yeah, I also helped you a lot."], "random_sampled": ["Oh yeah, when i do that, it hurts a lot more!", "Yeah, i noticed. She must be really loaded.", "Well, to tell the truth, i don't really feel like it tonight. I had a pretty hard day and i'm sort of tired.", "Good.", "Well, i do not know chinese tea at all.", "Sounds ideal. We'll get back to you in a couple of days then.", "That would have to be miss baymler, my fourth grade teacher.", "Unleaded. My car is new.", "Why? What's wrong?", "But, boris, i am not a baby any more.", "Did you? I didn't notice that. But still you should know it, for you have seen it with laura before.", "Finding the beautiful woman in a red dress next to the fountain wasn't all that hard.", "Look around.", "It's a private garden.", "So you should bring an umbrella often.", "Yes, i have, and three times in total.", "Thanks. Now let's decide which one of these suits looks best for this occasion.", "I don't know.", "That might be going overboard a bit. How about just that scarf with a bracelet?", "It feels a little tight around the waist. Do you have a bigger one?"], "bm25_sampled": ["Come on. Put the gun down.", "I saw a man come in with a gun.", "I saw the guy come in with a gun.", "It's too expensive. Can you come down a little?", "It was the pilot putting the wheels down. We must be coming into land. Are you frightened?", "That's too little. Well, i'll come down to 120 yuan.", "We're going to a night club for dinner and dancing, then we'll go down to the city square for the big celebration. There's always a fireworks display put on by the local government. We all want you to come too.", "What i mean is that we'll never be able to come down to your price. The gap is too great.", "Me too. I get much more done when i am under the gun.", "I'm sorry. I guess i'm too extreme when it comes putting money in the bank.", "Well, i know a lot of people have guns there. I think maybe it isn't too safe.", "Oh, i love you too!", "Oh thanks for inviting me. I'd love to come.", "And i love trying new recipes, which i usually test with my friends. You can come, too.", "Yes. Oh, it's you, linda. I haven't seen you for a long time. Well, come in and sit down. How about something to drink?", "I jumped the gun.", "I do like it. Can you come down a bit?", "I can come down and fix that for you if you'd like.", "Thank you, i'm coming down now.", "That will be ok. Come on, i can't wait to chow down."]}
